## Production: backup_plan
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                   NAME                   |
|--------|------------------------------------------|
| add    | `aws_backup_plan.backup_plan_default`    |
|        | `aws_backup_selection.selection_default` |
|        | `aws_backup_vault.vault`                 |
|        | `aws_backup_vault_policy.vault_policy`   |
|        | `aws_iam_role.role_backup`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_backup_plan.backup_plan_default will be created
  + resource "aws_backup_plan" "backup_plan_default" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "backup_plan_default"
      + tags     = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + version  = (known after apply)

      + rule {
          + completion_window        = 180
          + enable_continuous_backup = false
          + rule_name                = "backup_rule_default"
          + schedule                 = "cron(0 12 * * ? *)"
          + start_window             = 60
          + target_vault_name        = "vault"

          + lifecycle {
              + cold_storage_after = 30
              + delete_after       = 120
            }
        }
    }

  # aws_backup_selection.selection_default will be created
  + resource "aws_backup_selection" "selection_default" {
      + iam_role_arn  = (known after apply)
      + id            = (known after apply)
      + name          = "backup_selection_default"
      + not_resources = (known after apply)
      + plan_id       = (known after apply)
      + resources     = [
          + "arn:aws:dynamodb:ca-central-1:806721586252:table/url_shortener",
        ]

      + condition {
          + string_equals {
              + key   = (known after apply)
              + value = (known after apply)
            }

          + string_like {
              + key   = (known after apply)
              + value = (known after apply)
            }

          + string_not_equals {
              + key   = (known after apply)
              + value = (known after apply)
            }

          + string_not_like {
              + key   = (known after apply)
              + value = (known after apply)
            }
        }

      + selection_tag {
          + key   = "backup_plan"
          + type  = "STRINGEQUALS"
          + value = "default"
        }
    }

  # aws_backup_vault.vault will be created
  + resource "aws_backup_vault" "vault" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + kms_key_arn     = (known after apply)
      + name            = "vault"
      + recovery_points = (known after apply)
      + tags            = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all        = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
    }

  # aws_backup_vault_policy.vault_policy will be created
  + resource "aws_backup_vault_policy" "vault_policy" {
      + backup_vault_arn  = (known after apply)
      + backup_vault_name = "vault"
      + id                = (known after apply)
      + policy            = (known after apply)
    }

  # aws_iam_role.role_backup will be created
  + resource "aws_iam_role" "role_backup" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "backup.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AWSBackupServiceRolePolicyForS3Backup",
          + "arn:aws:iam::aws:policy/AWSBackupServiceRolePolicyForS3Restore",
          + "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForBackup",
          + "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForRestores",
        ]
      + max_session_duration  = 3600
      + name                  = "aws-backup-service-role-ca-central-1"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
